scenarios/project-list-payload.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="BMD-933 project list payload">
      <stringProp name="TestPlan.comments">Covers BMD-933 "Only load the project details the list page actually needs".

The two list endpoints — GET /users/{userId}/projects and GET /projects — currently
SELECT every column and spread the whole JSONB document into each row, so every
visible project ships its entire baseline/postIntervention body (~3 KB/parcel, MBs at
scale) even though the list view only renders id, name, createdAt, updatedAt. This
scenario drives both list endpoints under concurrency and asserts the acceptance
criteria, so it FAILS against an unfixed backend and PASSES once the projection +
limit/offset fix lands:

  1. Size Assertion — list payload stays under listSizeLimitBytes regardless of
     baseline size ("response size is flat regardless of baseline size").
  2. Response Assertion — payload does NOT contain the document-body-only keys
     "habitats" / "postIntervention" ("list responses exclude the document body").
  3. Response Assertion — payload DOES contain "has_baseline" (the projected flag).
  4. A paginated request per endpoint asserts 200 ("both list endpoints accept
     limit/offset"). Pre-fix the users endpoint 400s on unknown query params.
  5. Duration Assertion — guards against the multi-second event-loop stall a
     multi-MB synchronous JSON.stringify causes under concurrency.

REQUIRES a seeded environment: at least one project visible to the token's user that
has a baseline uploaded (ideally a large, multi-thousand-parcel one) — otherwise the
has_baseline / document-body assertions have nothing to exercise.

Runtime properties (all overridable with -J..., wired from env vars in entrypoint.sh):
  bearerToken         Defra ID id_token (Bearer) for the seeded user. No default —
                      must be supplied; obtain it from a stub/real login session.
  userId              path segment for /users/{userId}/projects (the handler trusts
                      the token sub, not this value). Default: me
  listSizeLimitBytes  max allowed list response size in bytes. Default: 262144 (256 KB)
  listMaxLatencyMs    max allowed list response time in ms. Default: 2000
  limit / offset      pagination params exercised against both endpoints. Default 50 / 0
  threads / rampSeconds / loops  load profile. Default 10 / 10 / 20
  domain / port / protocol / env  target service (set SERVICE_ENDPOINT to the backend)</stringProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments">
          <elementProp name="bearerToken" elementType="Argument">
            <stringProp name="Argument.name">bearerToken</stringProp>
            <stringProp name="Argument.value">${__P(bearerToken,)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="userId" elementType="Argument">
            <stringProp name="Argument.name">userId</stringProp>
            <stringProp name="Argument.value">${__P(userId,me)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="listSizeLimitBytes" elementType="Argument">
            <stringProp name="Argument.name">listSizeLimitBytes</stringProp>
            <stringProp name="Argument.value">${__P(listSizeLimitBytes,262144)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="listMaxLatencyMs" elementType="Argument">
            <stringProp name="Argument.name">listMaxLatencyMs</stringProp>
            <stringProp name="Argument.value">${__P(listMaxLatencyMs,2000)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="pageLimit" elementType="Argument">
            <stringProp name="Argument.name">pageLimit</stringProp>
            <stringProp name="Argument.value">${__P(limit,50)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="pageOffset" elementType="Argument">
            <stringProp name="Argument.name">pageOffset</stringProp>
            <stringProp name="Argument.value">${__P(offset,0)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults">
        <stringProp name="HTTPSampler.domain">${__P(domain, bng-metric-backend.${__P(env)}.cdp-int.defra.cloud)}</stringProp>
        <stringProp name="HTTPSampler.protocol">${__P(protocol, https)}</stringProp>
        <stringProp name="HTTPSampler.port">${__P(port, 443)}</stringProp>
        <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
        <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
      </ConfigTestElement>
      <hashTree/>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Auth + Accept headers">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Authorization</stringProp>
            <stringProp name="Header.value">Bearer ${bearerToken}</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Accept</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Project list endpoints">
        <stringProp name="ThreadGroup.num_threads">${__P(threads,10)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(rampSeconds,10)}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">${__P(loops,20)}</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /users/{userId}/projects">
          <stringProp name="HTTPSampler.path">/users/${userId}/projects</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Status 200">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <SizeAssertion guiclass="SizeAssertionGui" testclass="SizeAssertion" testname="List payload bounded (BMD-933 AC1)">
            <stringProp name="Assertion.scope">all</stringProp>
            <stringProp name="SizeAssertion.size">${listSizeLimitBytes}</stringProp>
            <intProp name="SizeAssertion.operator">6</intProp>
          </SizeAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Excludes document body (BMD-933 AC2)">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-802113328">habitats</stringProp>
              <stringProp name="583743425">postIntervention</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">20</intProp>
          </ResponseAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Includes has_baseline (BMD-933 AC3)">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1006645088">has_baseline</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Response under listMaxLatencyMs">
            <stringProp name="DurationAssertion.duration">${listMaxLatencyMs}</stringProp>
          </DurationAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /users/{userId}/projects?limit&amp;offset">
          <stringProp name="HTTPSampler.path">/users/${userId}/projects</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments">
              <elementProp name="limit" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">limit</stringProp>
                <stringProp name="Argument.value">${pageLimit}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
              <elementProp name="offset" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">offset</stringProp>
                <stringProp name="Argument.value">${pageOffset}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Accepts limit/offset — Status 200 (BMD-933 AC4)">
            <stringProp name="TestPlan.comments">Pre-fix the users endpoint Joi-validates query to sort/order only and 400s on unknown params, so this assertion is expected to fail until limit/offset are supported.</stringProp>
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <SizeAssertion guiclass="SizeAssertionGui" testclass="SizeAssertion" testname="List payload bounded (BMD-933 AC1)">
            <stringProp name="Assertion.scope">all</stringProp>
            <stringProp name="SizeAssertion.size">${listSizeLimitBytes}</stringProp>
            <intProp name="SizeAssertion.operator">6</intProp>
          </SizeAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /projects">
          <stringProp name="HTTPSampler.path">/projects</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Status 200">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <SizeAssertion guiclass="SizeAssertionGui" testclass="SizeAssertion" testname="List payload bounded (BMD-933 AC1)">
            <stringProp name="Assertion.scope">all</stringProp>
            <stringProp name="SizeAssertion.size">${listSizeLimitBytes}</stringProp>
            <intProp name="SizeAssertion.operator">6</intProp>
          </SizeAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Excludes document body (BMD-933 AC2)">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-802113328">habitats</stringProp>
              <stringProp name="583743425">postIntervention</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">20</intProp>
          </ResponseAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Includes has_baseline (BMD-933 AC3)">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1006645088">has_baseline</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Response under listMaxLatencyMs">
            <stringProp name="DurationAssertion.duration">${listMaxLatencyMs}</stringProp>
          </DurationAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /projects?limit&amp;offset">
          <stringProp name="HTTPSampler.path">/projects</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments">
              <elementProp name="limit" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">limit</stringProp>
                <stringProp name="Argument.value">${pageLimit}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
              <elementProp name="offset" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">offset</stringProp>
                <stringProp name="Argument.value">${pageOffset}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Accepts limit/offset — Status 200 (BMD-933 AC4)">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <SizeAssertion guiclass="SizeAssertionGui" testclass="SizeAssertion" testname="List payload bounded (BMD-933 AC1)">
            <stringProp name="Assertion.scope">all</stringProp>
            <stringProp name="SizeAssertion.size">${listSizeLimitBytes}</stringProp>
            <intProp name="SizeAssertion.operator">6</intProp>
          </SizeAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">report.csv</stringProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>